nxp-appcodehub/ap-qmc2g-industrial/qmc2g_industrial/app/isi_qmc_dgc/industrial_bootloader/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
        BOARD_InitSdPins();
        BOARD_InitXipFlexSPI1Pins();
        BOARD_InitDebugUartsPins();
        BOARD_InitUserButtonsPins();
        BOARD_InitUserLedsPins();
        BOARD_InitSecureI2cPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */




/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSdPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: A16, peripheral: USDHC1, signal: 'usdhc_data, 3', pin_signal: GPIO_SD_B1_05}
  - {pin_num: B15, peripheral: USDHC1, signal: 'usdhc_data, 2', pin_signal: GPIO_SD_B1_04}
  - {pin_num: B17, peripheral: USDHC1, signal: 'usdhc_data, 1', pin_signal: GPIO_SD_B1_03}
  - {pin_num: C15, peripheral: USDHC1, signal: 'usdhc_data, 0', pin_signal: GPIO_SD_B1_02}
  - {pin_num: D15, peripheral: USDHC1, signal: usdhc_clk, pin_signal: GPIO_SD_B1_01}
  - {pin_num: B16, peripheral: USDHC1, signal: usdhc_cmd, pin_signal: GPIO_SD_B1_00}
  - {pin_num: K16, peripheral: USDHC1, signal: usdhc_cd_b, pin_signal: GPIO_AD_32}
  - {pin_num: J16, peripheral: USDHC1, signal: usdhc_vselect, pin_signal: GPIO_AD_34}
  - {pin_num: G17, peripheral: USDHC1, signal: usdhc_reset_b, pin_signal: GPIO_AD_35}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSdPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSdPins(void) {
	CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

	  IOMUXC_SetPinMux(
	      IOMUXC_GPIO_AD_32_USDHC1_CD_B,          /* GPIO_AD_32 is configured as USDHC1_CD_B */
	      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	  IOMUXC_SetPinMux(
	        IOMUXC_GPIO_AD_32_GPIO_MUX3_IO31,       /* GPIO_AD_32 is configured as GPIO_MUX3_IO31 */
	        0U);
	  IOMUXC_SetPinMux(
	      IOMUXC_GPIO_AD_34_GPIO10_IO01,
	      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	  IOMUXC_SetPinMux(
	      IOMUXC_GPIO_AD_35_GPIO10_IO02,
	      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	  IOMUXC_SetPinMux(
	      IOMUXC_GPIO_SD_B1_00_USDHC1_CMD,        /* GPIO_SD_B1_00 is configured as USDHC1_CMD */
	      1U);                                    /* Software Input On Field: Input Path is determined by functionality */
	  IOMUXC_SetPinMux(
	      IOMUXC_GPIO_SD_B1_01_USDHC1_CLK,        /* GPIO_SD_B1_01 is configured as USDHC1_CLK */
	      1U);                                    /* Software Input On Field: Input Path is determined by functionality */
	  IOMUXC_SetPinMux(
	      IOMUXC_GPIO_SD_B1_02_USDHC1_DATA0,      /* GPIO_SD_B1_02 is configured as USDHC1_DATA0 */
	      1U);                                    /* Software Input On Field: Input Path is determined by functionality */
	  IOMUXC_SetPinMux(
	      IOMUXC_GPIO_SD_B1_03_USDHC1_DATA1,      /* GPIO_SD_B1_03 is configured as USDHC1_DATA1 */
	      1U);                                    /* Software Input On Field: Input Path is determined by functionality */
	  IOMUXC_SetPinMux(
	      IOMUXC_GPIO_SD_B1_04_USDHC1_DATA2,      /* GPIO_SD_B1_04 is configured as USDHC1_DATA2 */
	      1U);                                    /* Software Input On Field: Input Path is determined by functionality */
	  IOMUXC_SetPinMux(
	      IOMUXC_GPIO_SD_B1_05_USDHC1_DATA3,      /* GPIO_SD_B1_05 is configured as USDHC1_DATA3 */
	      1U);                                    /* Software Input On Field: Input Path is determined by functionality */
	  IOMUXC_GPR->GPR43 = ((IOMUXC_GPR->GPR43 &
	    (~(IOMUXC_GPR_GPR43_GPIO_MUX3_GPIO_SEL_HIGH_MASK))) /* Mask bits to zero which are setting */
	      | IOMUXC_GPR_GPR43_GPIO_MUX3_GPIO_SEL_HIGH(0x8000U) /* GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function: 0x8000U */
	    );

	  IOMUXC_SetPinConfig(
	      IOMUXC_GPIO_SD_B1_00_USDHC1_CMD,        /* GPIO_SD_B1_00 PAD functional properties : */
	      0x04U);                                 /* PDRV Field: high drive strength
	                                                 Pull Down Pull Up Field: Internal pullup resistor enabled
	                                                 Open Drain Field: Disabled
	                                                 Domain write protection: Both cores are allowed
	                                                 Domain write protection lock: Neither of DWP bits is locked */
	  IOMUXC_SetPinConfig(
	      IOMUXC_GPIO_SD_B1_01_USDHC1_CLK,        /* GPIO_SD_B1_01 PAD functional properties : */
	      0x0CU);                                 /* PDRV Field: high drive strength
	                                                 Pull Down Pull Up Field: No Pull
	                                                 Open Drain Field: Disabled
	                                                 Domain write protection: Both cores are allowed
	                                                 Domain write protection lock: Neither of DWP bits is locked */
	  IOMUXC_SetPinConfig(
	      IOMUXC_GPIO_SD_B1_02_USDHC1_DATA0,      /* GPIO_SD_B1_02 PAD functional properties : */
	      0x04U);                                 /* PDRV Field: high drive strength
	                                                 Pull Down Pull Up Field: Internal pullup resistor enabled
	                                                 Open Drain Field: Disabled
	                                                 Domain write protection: Both cores are allowed
	                                                 Domain write protection lock: Neither of DWP bits is locked */
	  IOMUXC_SetPinConfig(
	      IOMUXC_GPIO_SD_B1_03_USDHC1_DATA1,      /* GPIO_SD_B1_03 PAD functional properties : */
	      0x04U);                                 /* PDRV Field: high drive strength
	                                                 Pull Down Pull Up Field: Internal pullup resistor enabled
	                                                 Open Drain Field: Disabled
	                                                 Domain write protection: Both cores are allowed
	                                                 Domain write protection lock: Neither of DWP bits is locked */
	  IOMUXC_SetPinConfig(
	      IOMUXC_GPIO_SD_B1_04_USDHC1_DATA2,      /* GPIO_SD_B1_04 PAD functional properties : */
	      0x04U);                                 /* PDRV Field: high drive strength
	                                                 Pull Down Pull Up Field: Internal pullup resistor enabled
	                                                 Open Drain Field: Disabled
	                                                 Domain write protection: Both cores are allowed
	                                                 Domain write protection lock: Neither of DWP bits is locked */
	  IOMUXC_SetPinConfig(
	      IOMUXC_GPIO_SD_B1_05_USDHC1_DATA3,      /* GPIO_SD_B1_05 PAD functional properties : */
	      0x04U);                                 /* PDRV Field: high drive strength
	                                                 Pull Down Pull Up Field: Internal pullup resistor enabled
	                                                 Open Drain Field: Disabled
	                                                 Domain write protection: Both cores are allowed
	                                                 Domain write protection lock: Neither of DWP bits is locked */
}


