nxp-appcodehub/ap-qmc2g-industrial/qmc2g_industrial/app/isi_qmc_dgc/industrial_bootloader/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDebugUartsPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDebugUartsPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_08_LPUART8_TXD,     /* GPIO_DISP_B2_08 is configured as LPUART8_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_09_LPUART8_RXD,     /* GPIO_DISP_B2_09 is configured as LPUART8_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_40_LPUART6_TXD,      /* GPIO_EMC_B1_40 is configured as LPUART6_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_41_LPUART6_RXD,      /* GPIO_EMC_B1_41 is configured as LPUART6_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitUserButtonsPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: P8, peripheral: GPIO6, signal: 'gpio_mux_io, 06', pin_signal: GPIO_LPSR_06, direction: INPUT, gpio_interrupt: kGPIO_IntRisingEdge, pull_up_down_config: Pull_Up,
    pull_keeper_select: Pull, drive_strength: Normal}
  - {pin_num: R8, peripheral: GPIO6, signal: 'gpio_mux_io, 07', pin_signal: GPIO_LPSR_07, direction: INPUT, gpio_interrupt: kGPIO_IntRisingEdge, pull_up_down_config: Pull_Up,
    pull_keeper_select: Pull, drive_strength: Normal}
  - {pin_num: U8, peripheral: GPIO6, signal: 'gpio_mux_io, 08', pin_signal: GPIO_LPSR_08, direction: INPUT, gpio_interrupt: kGPIO_IntRisingEdge, pull_up_down_config: Pull_Up,
    pull_keeper_select: Pull, drive_strength: Normal}
  - {pin_num: P5, peripheral: GPIO6, signal: 'gpio_mux_io, 09', pin_signal: GPIO_LPSR_09, direction: INPUT, gpio_interrupt: kGPIO_IntRisingEdge, pull_up_down_config: Pull_Up,
    pull_keeper_select: Pull, drive_strength: Normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUserButtonsPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitUserButtonsPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */

  /* GPIO configuration of USER_BUTTON1 on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_06 (pin P8) */
  gpio_pin_config_t USER_BUTTON1_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntRisingEdge
  };
  /* Initialize GPIO functionality on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_06 (pin P8) */
  GPIO_PinInit(GPIO6, 6U, &USER_BUTTON1_config);
  /* Enable GPIO pin interrupt on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_06 (pin P8) */

  /* GPIO configuration of USER_BUTTON2 on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_07 (pin R8) */
  gpio_pin_config_t USER_BUTTON2_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntRisingEdge
  };
  /* Initialize GPIO functionality on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_07 (pin R8) */
  GPIO_PinInit(GPIO6, 7U, &USER_BUTTON2_config);
  /* Enable GPIO pin interrupt on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_07 (pin R8) */

  /* GPIO configuration of USER_BUTTON3 on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_08 (pin U8) */
  gpio_pin_config_t USER_BUTTON3_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntRisingEdge
  };
  /* Initialize GPIO functionality on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_08 (pin U8) */
  GPIO_PinInit(GPIO6, 8U, &USER_BUTTON3_config);
  /* Enable GPIO pin interrupt on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_08 (pin U8) */

  /* GPIO configuration of USER_BUTTON4 on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_09 (pin P5) */
  gpio_pin_config_t USER_BUTTON4_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntRisingEdge
  };
  /* Initialize GPIO functionality on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_09 (pin P5) */
  GPIO_PinInit(GPIO6, 9U, &USER_BUTTON4_config);
  /* Enable GPIO pin interrupt on IOMUXC_LPSR_SW_MUX_CTL_PAD_GPIO_LPSR_09 (pin P5) */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_06_GPIO_MUX6_IO06,     /* GPIO_LPSR_06 is configured as GPIO_MUX6_IO06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_07_GPIO_MUX6_IO07,     /* GPIO_LPSR_07 is configured as GPIO_MUX6_IO07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_08_GPIO_MUX6_IO08,     /* GPIO_LPSR_08 is configured as GPIO_MUX6_IO08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_09_GPIO_MUX6_IO09,     /* GPIO_LPSR_09 is configured as GPIO_MUX6_IO09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_06_GPIO_MUX6_IO06,     /* GPIO_LPSR_06 PAD functional properties : */
      0x0CU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain LPSR Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_07_GPIO_MUX6_IO07,     /* GPIO_LPSR_07 PAD functional properties : */
      0x0CU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain LPSR Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_08_GPIO_MUX6_IO08,     /* GPIO_LPSR_08 PAD functional properties : */
      0x0CU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain LPSR Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_09_GPIO_MUX6_IO09,     /* GPIO_LPSR_09 PAD functional properties : */
      0x0CU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain LPSR Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}


